Revit 2026 API

# FamilyManagerAssociateElementParameterToFamilyParameter Method

---

Associates or disassociates the element parameter to an existing family parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AssociateElementParameterToFamilyParameter(
	Parameter elementParameter,
	FamilyParameter familyParameter
)
```
```vb
Public Sub AssociateElementParameterToFamilyParameter (
	elementParameter As Parameter,
	familyParameter As FamilyParameter
)
```
```cpp
public:
void AssociateElementParameterToFamilyParameter(
	Parameter^ elementParameter,
	FamilyParameter^ familyParameter
)
```
```fsharp
member AssociateElementParameterToFamilyParameter :
        elementParameter : Parameter *
        familyParameter : FamilyParameter -> unit
```

#### Parameters

elementParameter Parameter
    The parameter of an element in family.
familyParameter FamilyParameter
    The existing family parameter. If the input to this argument is , it will disassociate the element parameter from any family parameters.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"elementParameter"-is . |
| ArgumentException | Thrown when the input argument-"elementParameter" or "familyParameter"-is an invalid parameter, or the input argument-"elementParameter"-cannot be associated. |
| InvalidOperationException | Thrown when the family parameter binding failed. |

The parameter types of these two input parameter should be same, if not an exception with failure information will be thrown.

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace